snlkuharlocal/src/Documents/АктВыполненныхРаботАсу/АктВыполненныхРаботАсу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВыполненныхРаботАсу</name>
  <basedOn>Document.ЗадачиАСУ</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗадачиАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадачи</name>
    <type>
      <types>CatalogRef.СостояниеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>НичегоНеДелалось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.ЗадачиАСУ</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеВыполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>CatalogRef.СостояниеЗадачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/СостояниеЗадачи/СостояниеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостояниеЗадачи</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Done</description>
    </items>
    <items>
      <name>НетАктов</name>
      <description>Нет актов</description>
    </items>
    <items>
      <name>Отклонённые</name>
      <description>ОтменённыеЗадачи</description>
    </items>
  </predefined>
  <attributes>
    <name>Цвет1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/АктВыполненныхРаботАсу/ObjectModule.bsl
// Кухарь А.Ю.  24.06.2022 начало
//   Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) экспорт
	// Кухарь А.Ю.  24.06.2022 конец
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗадачиАСУ") Тогда
		// Заполнение шапки
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		ДокОснование = ДанныеЗаполнения.Ссылка; 
		СостояниеЗадачи=ДанныеЗаполнения.СостояниеЗадачи;
		
		// Кухарь А.Ю.  02.09.2022 начало
		// 		Дата=ДанныеЗаполнения.Дата;	 
		дата=ТекущаяДата();
		// Кухарь А.Ю.  02.09.2022 конец
		
		// Кухарь А.Ю.  24.06.2022 начало
		// Андреев И.Д. 03.08.2022 начало
		//ДатафактическогоЗавершения = КонецНедели(ТекущаяДата());
		// Андреев И.Д. 03.08.2022 конец
		
		
		//
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("Исполнитель", Исполнитель);
		ДанныеЗаполнения.Свойство("ДокОснование", ДокОснование);
		ДанныеЗаполнения.Свойство("СостояниеЗадачи", СостояниеЗадачи);
		ДанныеЗаполнения.Свойство("Дата",Дата);
		
		// Андреев И.Д. 03.08.2022 начало
		
		// Андреев И.Д. 03.08.2022 конец
		// Кухарь А.Ю.  24.06.2022 конец
		
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	СтароеСостояние=ДокОснование.СостояниеЗадачи;
	СтарыйИсполнитель = ДокОснование.Исполнитель;
	если не ЗначениеЗаполнено(СтароеСостояние) тогда
		СтароеСостояние="Пустое состояние";
	КонецЕсли;
	если не ЗначениеЗаполнено(СтарыйИсполнитель) тогда
		СтарыйИсполнитель="Пустой исполнитель";
	КонецЕсли;
	
	// Андреев И.Д. 09.08.2022 начало
	// Заполнение Фактического окончания
	НужныйОбъект = ДокОснование.ПолучитьОбъект();
	
	Если СостояниеЗадачи = Справочники.СостояниеЗадачи.Выполнена или СостояниеЗадачи = Справочники.СостояниеЗадачи.Отклонённые тогда;		
		НужныйОбъект.ДатаФактическогоОкончания = КонецНедели(ТекущаяДата());
	КонецЕсли;
	// Андреев И.Д. 09.08.2022 конец
	
	// Кухарь А.Ю.  09.08.2022 начало
	если НужныйОбъект.ДатаФактическогоНачала=ПустаяДата() и НичегоНеДелалось=Ложь тогда
		НужныйОбъект.ДатаФактическогоНачала = НачалоНедели(ТекущаяДата());
	КонецЕсли;
	
	// Кухарь А.Ю.  09.08.2022 конец
	
	
	если СтароеСостояние<>СостояниеЗадачи или СтарыйИсполнитель<>Исполнитель тогда
		если СтароеСостояние<>СостояниеЗадачи тогда	
			НужныйОбъект.СостояниеЗадачи=СостояниеЗадачи;			
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Изменено состояние "+НужныйОбъект+" с "+СтароеСостояние + " на "+СостояниеЗадачи;
			Сообщение.Сообщить();
			
		КонецЕсли;	
		
		если СтарыйИсполнитель<>Исполнитель тогда	
			НужныйОбъект.СостояниеЗадачи=СостояниеЗадачи;					
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Изменен исполнитель "+НужныйОбъект+" с "+СтарыйИсполнитель + " на "+Исполнитель;
			Сообщение.Сообщить();
			
		КонецЕсли;	
		
		
		
	КонецЕсли;
	
	// Кухарь А.Ю.  09.08.2022 начало
	//
	если НужныйОбъект.Модифицированность() тогда 
		НужныйОбъект.Записать();
	КонецЕсли;
	// Кухарь А.Ю.  09.08.2022 конец
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Автор = параметрысеанса.Пользователь.ФизЛицо;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если ЗначениеНеЗаполнено(Автор) тогда
		Автор=параметрысеанса.Пользователь.ФизЛицо; 
	КонецЕсли;
	
	
КонецПроцедуры
